app/views/firearms/show.html.erb

                    <h4>Current barrel:</h4>
                    <%= link_to @firearm.barrels.last.caliber, barrel_path(@firearm.barrels.last.id)%>
---
SELECT  "barrels".* FROM "barrels" WHERE "barrels"."firearm_id" = ? ORDER BY "barrels"."id" DESC LIMIT ?  [["firearm_id", 4], ["LIMIT", 1]]