app/controllers/barrels_controller.rb

SELECT "barrels".* FROM "barrels" INNER JOIN "firearms" "firearms_barrels" ON "firearms_barrels"."id" = "barrels"."firearm_id" INNER JOIN "firearms" ON "barrels"."firearm_id" = "firearms"."id" WHERE "firearms"."user_id" = ?  [["user_id", 2]]
---
  def index
    @barrels = current_user.barrels.all

SELECT  "barrels".* FROM "barrels" WHERE "barrels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @barrel = Barrel.find_by(id: params[:id])

INSERT INTO "barrels" ("caliber", "barrel_type", "length", "twist", "contour", "rifling", "user_id", "firearm_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @barrel = current_user.barrels.build(barrel_params)
    if @barrel.save

UPDATE "barrels" SET "firearm_id" = ?, "updated_at" = ? WHERE "barrels"."id" = ?  [["firearm_id", 3], ["updated_at", "2018-03-16 19:09:31.056891"], ["id", 1]]
---
  def update
    if @barrel.update(barrel_params)

DELETE FROM "barrels" WHERE "barrels"."id" = ?  [["id", 1]]
---
  def destroy
    @barrel.destroy

SELECT  "barrels".* FROM "barrels" WHERE "barrels"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def set_barrel
    @barrel = Barrel.find_by(id: params[:id])