app/controllers/firearms_controller.rb

  def index
    @firearms = current_user.firearms.all
---
SELECT "firearms".* FROM "firearms" WHERE "firearms"."user_id" = ?  [["user_id", 1]]

  def show
    @firearm = Firearm.find_by(id: params[:id])
---
SELECT  "firearms".* FROM "firearms" WHERE "firearms"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]

  def create
    @firearm = current_user.firearms.build(firearm_params)
    if @firearm.save
---
INSERT INTO "firearms" ("name", "firearm_type", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test"], ["firearm_type", "etst"], ["description", "l;kajsdfasdf"], ["created_at", "2018-03-13 19:23:47.900653"], ["updated_at", "2018-03-13 19:23:47.900653"]]

  def update
    if @firearm.update(firearm_params)
---
UPDATE "firearms" SET "firearm_type" = ?, "updated_at" = ? WHERE "firearms"."id" = ?  [["firearm_type", "Bolt-Action"], ["updated_at", "2018-03-15 04:21:49.548151"], ["id", 3]]

  def destroy
    @firearm.destroy
---
DELETE FROM "firearms" WHERE "firearms"."id" = ?  [["id", 10]]

  def set_firearm
    @firearm = Firearm.find_by(id: params[:id])
---
SELECT  "firearms".* FROM "firearms" WHERE "firearms"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]