app/controllers/outings_controller.rb

  def index
    @outings = current_user.outings.includes(:firearms).all
---
SELECT "firearms".* FROM "firearms" WHERE "firearms"."user_id" = ?  [["user_id", 1]]
SELECT "outings".* FROM "outings" WHERE "outings"."user_id" = ?  [["user_id", 1]]

  def show
    @outing = Outing.find_by(id: params[:id])
---
SELECT  "outings".* FROM "outings" WHERE "outings"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def create
    @outing = current_user.outings.build(outing_params)
    if @outing.save
---
INSERT INTO "outings" ("date", "outing_type", "firearm_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["date", "2018-03-19 00:00:00"], ["outing_type", "Hunting"], ["firearm_id", 1], ["user_id", 1], ["created_at", "2018-03-19 23:11:57.836129"], ["updated_at", "2018-03-19 23:11:57.836129"]]

  def destroy
    @outing.destroy
---
DELETE FROM "outings" WHERE "outings"."id" = ?  [["id", 1]]

  def set_outing
    @outing = Outing.find_by(id: params[:id])
---
SELECT  "outings".* FROM "outings" WHERE "outings"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]